---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectShapeTypeOptions
source: html/3cfeafd1-f0c2-8cbf-629e-a7d0ab470c3f.htm
---
# DirectShapeTypeOptions Properties

Determines whether or not duplicate DirectShapeType names are allowed.